LtyIntegrationTest/LtyTransaction/src/test/resources/data/json/Request_cusLookupByZipCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.macys.com/enterprise_services" xmlns:v11="http://loyalty.macys.com/schemas/loyalty.customer/CusRequest/v11_0" xmlns:v111="http://loyalty.macys.com/schemas/loyalty.customer/CusCommon/v11_0" xmlns:v112="http://loyalty.macys.com/schemas/loyalty.customer/MacysCommon/v11_0">
   <soapenv:Header>
      <ent:requestor_info>
         <!--Optional:-->
         <version>12</version>
         <client_id>Stores</client_id>
         <subclient_id>SPOS</subclient_id>
      </ent:requestor_info>
   </soapenv:Header>
   <soapenv:Body>
      <v11:CusLookupByAddrZipReq>
         <v111:AddressLine1>CA-1</v111:AddressLine1>
         <v111:PostalCd>94132</v111:PostalCd>
         <v112:Division>71</v112:Division>
         <v112:Channel>SPOS</v112:Channel>
         <v112:AssociateId>121344</v112:AssociateId>
      </v11:CusLookupByAddrZipReq>
   </soapenv:Body>
</soapenv:Envelope>